# Exercise 4: Data definition with SQL II 

In this exercise you will familiarize yourself with more of the DDL operations and integrity constraints.

- Load the SQL module

In [1]:
%load_ext sql

**In case you have the of local installation performed:**
- Connect to the PostgreSQL database:  
```python
%sql postgresql://username:password@server_address/database_name
```
  For most of you:  
  - server_address = localhost  
  - database_name = postgres

In [2]:
%sql postgresql://postgres:postgres@localhost/postgres

(psycopg2.OperationalError) could not connect to server: Connection refused
	Is the server running on host "localhost" (127.0.0.1) and accepting
	TCP/IP connections on port 5432?
could not connect to server: Cannot assign requested address
	Is the server running on host "localhost" (::1) and accepting
	TCP/IP connections on port 5432?

(Background on this error at: https://sqlalche.me/e/14/e3q8)
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

**In case you use the of Docker solution (Docker Container should already run):**
- Connect to the PostgreSQL database:  
```python
%sql postgresql://username:password@server_address
```
  For all of you:  
  - server_address = db 
  - database_name = postgres
  - password = example

In [3]:
%sql postgresql://postgres:example@db

- Create a new ***schema*** named ***ise_ex4*** with the SQL command provided below.  
  You will learn more about [schemas](https://www.postgresql.org/docs/current/static/ddl-schemas.html) in later lectures. For now, you may consider them as sandboxes, that allow the creation and editting of a collection of tables independently from the rest of the database system.

In [4]:
%%sql 
DROP SCHEMA IF EXISTS ise_ex4 CASCADE;
CREATE SCHEMA ise_ex4;

 * postgresql://postgres:***@db
Done.
Done.

[]

- Since we will work inside this schema for the rest of the sheet, you can run the script below to start over.  
***Warning:*** this will delete all your tables and data in the **ise_ex4** schema.

In [5]:
%%sql
DROP SCHEMA IF EXISTS ise_ex4 CASCADE;
CREATE SCHEMA ise_ex4;

 * postgresql://postgres:***@db
Done.
Done.

[]

- Do you remember the ***countries*** table from the previous exercise?  
  Re-create the table with the following [contraints](https://www.postgresql.org/docs/current/static/ddl-constraints.html):  
  - **`id`** is used as primary key and cannot be NULL (question: can primary keys be NULL?)
  -**`name`** is unique and cannot be NULL (question: can entries for attributes with the unique constraint be NULL?)
  - **`population`** and area cannot be negative, but can be NULL
  - **`gini`** must be in the range [0, 100] and can be NULL

|id|name|population|area [$km^2$]|gini|
|-:|:-|-:|-:|-:|
|number|string|number|number|number|  

- When creating a table inside a specific schema, the SQL command changes to:  
```sql
CREATE TABLE schema_name.table_name( ... );
```

In [6]:
%%sql
CREATE TABLE ise_ex4.countries(
    id integer PRIMARY KEY,
    name varchar(40) NOT NULL UNIQUE,
    population int CHECK (population >= 0),
    area bigint CHECK (area >= 0),
    gini numeric(4, 1) CHECK (gini >= 0 AND gini <=100)
);

 * postgresql://postgres:***@db
Done.

[]

* Check the table contents. There should be the five attributes you spacified.

In [7]:
%sql SELECT * FROM ise_ex4.countries;

 * postgresql://postgres:***@db
0 rows affected.

[]

- Populate the ***countries*** table with the following values:  

|id|name|population|area [$km^2$]|gini|
|-:|:-|-:|-:|-:|
|1|Switzerland|8401120|41285|29.5|
|2|USA|325365189|9833520|40.8|
|3|Cost Rica|4857274|51000|40.7|
|4|Iran|80829192|1648195|37.4|
|5|Kazakhstan|17987736|2724900|26.4|

In [8]:
%%sql
INSERT INTO ise_ex4.countries
    (id, name, population, area, gini) VALUES
    (1, 'Switzerland', 8401120, 41285, 29.5), 
    (2, 'USA', 325365189, 9833520, 40.8), 
    (3, 'Cost Rica', 4857274, 51000, 40.7), 
    (4, 'Iran', 80829192, 1648195, 37.4), 
    (5, 'Kazakhstan', 17987736, 2724900, 26.4);

 * postgresql://postgres:***@db
5 rows affected.

[]

In [9]:
%sql SELECT * FROM ise_ex4.countries;

 * postgresql://postgres:***@db
5 rows affected.

[(1, 'Switzerland', 8401120, 41285, Decimal('29.5')),
 (2, 'USA', 325365189, 9833520, Decimal('40.8')),
 (3, 'Cost Rica', 4857274, 51000, Decimal('40.7')),
 (4, 'Iran', 80829192, 1648195, Decimal('37.4')),
 (5, 'Kazakhstan', 17987736, 2724900, Decimal('26.4'))]

* If, in the following, you don't get the expected results, you've probably created the table incorrectly. Go back and try again, paying close attention to the constraints.

- Try to insert into the ***countries*** table the following tuple:  
  (`id` ↦ 5, `name` ↦ Sweden, `area` ↦ 447435, `population` ↦ 9903000, `gini` ↦ 27.2)

In [10]:
%%sql
INSERT INTO ise_ex4.countries
VALUES (5, 'Sweden', 447435, 9903000, 27.2);

 * postgresql://postgres:***@db
(psycopg2.errors.UniqueViolation) duplicate key value violates unique constraint "countries_pkey"
DETAIL:  Key (id)=(5) already exists.

[SQL: INSERT INTO ise_ex4.countries
VALUES (5, 'Sweden', 447435, 9903000, 27.2);]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

- Why did this fail? Hint: scroll to the end of the traceback to see the error emitted by Postgresql.
  You should see 'UniqueViolation: duplicate key value violates unique constraint "countries_pkey"'.
  
  Now try and insert into the ***countries*** table the following tuple:  
  (`id` ↦ 6, `name` ↦ NULL, `area` ↦ 447435, `population` ↦ 9903000, `gini` ↦ 27.2)

In [11]:
%%sql
INSERT INTO ise_ex4.countries
VALUES (6, NULL, 447435, 9903000, 27.2);

 * postgresql://postgres:***@db
(psycopg2.errors.NotNullViolation) null value in column "name" of relation "countries" violates not-null constraint
DETAIL:  Failing row contains (6, null, 447435, 9903000, 27.2).

[SQL: INSERT INTO ise_ex4.countries
VALUES (6, NULL, 447435, 9903000, 27.2);]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

- Why did this fail? Hint: scroll to the end of the traceback to see the error emitted by Postgresql.
  You should see 'IntegrityError: (psycopg2.errors.NotNullViolation) null value in column "name" of relation "countries" violates not-null constraint'

  Now try and insert into the ***countries*** table the following tuple:  
  (`id` ↦ 6, `name` ↦ Sweden, `area` ↦ 447435, `population` ↦ -9903000, `gini` ↦ 27.2)

In [12]:
%%sql
INSERT INTO ise_ex4.countries
VALUES (6, 'Sweden', 447435, 9903000, 27.2);

 * postgresql://postgres:***@db
1 rows affected.

[]

- Why did this fail? Hint: scroll to the end of the traceback to see the error emitted by Postgresql.
  You should see 'CheckViolation: new row for relation "countries" violates check constraint "countries_population_check"'

  Insert into the ***countries*** table the following tuple:  
  (`id` ↦ 6, `name` ↦ Sweden, `population` ↦ 9903000, `area` ↦ 447435, `gini` ↦ 27.275)

In [13]:
%%sql
INSERT INTO ise_ex4.countries
VALUES (6, 'Sweden', 447435, 9903000, 27.275);

 * postgresql://postgres:***@db
(psycopg2.errors.UniqueViolation) duplicate key value violates unique constraint "countries_pkey"
DETAIL:  Key (id)=(6) already exists.

[SQL: INSERT INTO ise_ex4.countries
VALUES (6, 'Sweden', 447435, 9903000, 27.275);]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

* Finally, this should have worked! Check the table, you should see these contents:

|id|name|population|area [$km^2$]|gini|
|-:|:-|-:|-:|-:|
|1|Switzerland|8401120|41285|29.5|
|2|USA|325365189|9833520|40.8|
|3|Cost Rica|4857274|51000|40.7|
|4|Iran|80829192|1648195|37.4|
|5|Kazakhstan|17987736|2724900|26.4|
|6|Sweden|9903000|447435|27.3|

In [14]:
%sql SELECT * FROM ise_ex4.countries;

 * postgresql://postgres:***@db
6 rows affected.

[(1, 'Switzerland', 8401120, 41285, Decimal('29.5')),
 (2, 'USA', 325365189, 9833520, Decimal('40.8')),
 (3, 'Cost Rica', 4857274, 51000, Decimal('40.7')),
 (4, 'Iran', 80829192, 1648195, Decimal('37.4')),
 (5, 'Kazakhstan', 17987736, 2724900, Decimal('26.4')),
 (6, 'Sweden', 447435, 9903000, Decimal('27.2'))]

- Create the ***movies*** table, so that the following constraints are met:
  - **`title`** and **`year`** are used as primary key
  - **`year`** must be in the range [1900-2100]  
  - **`length`** has default value 120
  - **`genre`** has default value Drama
  
  Don't forget to use the schema, so the full table name should be `ise_ex4.movies`.
  
|title |year   |length |genre |  
|:----:|:-----:|:-----:|:-----|  
|string|integer|integer|string|

In [15]:
%%sql
CREATE TABLE ise_ex4.movies(
    title varchar(40),
    year int CHECK (year >= 1900 AND year <= 2100),
    length int DEFAULT 120,
    genre varchar(40) DEFAULT 'Drama',
    PRIMARY KEY (title, year)
);

 * postgresql://postgres:***@db
Done.

[]

- Populate the ***movies*** table:

|title|year|length|genre| 
|----:|:--:|:----:|:---:|  
|Bladerunner|1982|117|Thriller|  
|Arrival|2016|116|Sci-Fi|  
|La La Land|2016|128|Drama|  
|Bladerunner 2049|2017|163|Thriller|

In [16]:
%%sql
INSERT INTO ise_ex4.movies
    (title, year, length, genre) VALUES 
    ('Bladerunner', 1982, 117, 'Thriller'),
    ('Arrival', 2016, 116, 'Sci-Fi'),
    ('La La Land', 2016, 128, 'Drama'),
    ('Bladerunner 2049', 2017, 163, 'Thriller');

 * postgresql://postgres:***@db
4 rows affected.

[]

In [17]:
%sql SELECT * FROM ise_ex4.movies;

 * postgresql://postgres:***@db
4 rows affected.

[('Bladerunner', 1982, 117, 'Thriller'),
 ('Arrival', 2016, 116, 'Sci-Fi'),
 ('La La Land', 2016, 128, 'Drama'),
 ('Bladerunner 2049', 2017, 163, 'Thriller')]

- Create the following ***credits*** table:  
   
|name  |birthdate|
|:----:|:-------:|
|string|date     |  

Constraints:
- **`name`** can be NULL
- **`birthdate`** has default value of 31. of January, 1970

Again, don't forget the schema.

In [18]:
%%sql
CREATE TABLE ise_ex4.credits(
    name varchar(40),
    birthdate date DEFAULT '1970-01-31'
);

 * postgresql://postgres:***@db
Done.

[]

- Alter that ***credits*** table, so that the following constraints are met:
  - **`name`** is used as a primary key
   
|name  |birthdate|
|:----:|:-------:|
|string|date     |

In [19]:
%%sql
ALTER TABLE ise_ex4.credits
ADD PRIMARY KEY (name);

 * postgresql://postgres:***@db
Done.

[]

- Populate the ***credits*** table:  

|name|birthdate|
|----------:|:-------:|
|Denis Villeneuve|03.10.1967|
|Amy Adams|20.08.1974|
|Ryan Gosling|12.11.1980|
|Harrison Ford|13.07.1942|
|Ridley Scott|30.11.1937|
|Emma Stone|06.11.1988|
|Rutger Hauer|23.01.1944|
|Sean Young|20.11.1959|

In [20]:
%%sql
INSERT INTO ise_ex4.credits
    (name, birthdate) VALUES 
    ('Denis Villeneuve', '1967-10-03'), 
    ('Amy Adams', '1974-08-20'), 
    ('Ryan Gosling', '1980-11-12'), 
    ('Harrison Ford', '1942-07-12'), 
    ('Ridley Scott', '1937-11-30'), 
    ('Emma Stone', '1988-11-06'), 
    ('Rutger Hauer', '1944-01-23'), 
    ('Sean Young', '1959-11-20');

 * postgresql://postgres:***@db
8 rows affected.

[]

In [21]:
%sql SELECT * FROM ise_ex4.credits;

 * postgresql://postgres:***@db
8 rows affected.

[('Denis Villeneuve', datetime.date(1967, 10, 3)),
 ('Amy Adams', datetime.date(1974, 8, 20)),
 ('Ryan Gosling', datetime.date(1980, 11, 12)),
 ('Harrison Ford', datetime.date(1942, 7, 12)),
 ('Ridley Scott', datetime.date(1937, 11, 30)),
 ('Emma Stone', datetime.date(1988, 11, 6)),
 ('Rutger Hauer', datetime.date(1944, 1, 23)),
 ('Sean Young', datetime.date(1959, 11, 20))]

* Let's try and add a tuple with a duplicate primary key. If you've correctly added the primary key constraints, this should fail with 'IntegrityError: (psycopg2.errors.UniqueViolation) duplicate key value violates unique constraint "credits_pkey"'

In [22]:
%%sql
INSERT INTO ise_ex4.credits
    (name, birthdate) VALUES
    ('Rutger Hauer', '1961-02-02');

 * postgresql://postgres:***@db
(psycopg2.errors.UniqueViolation) duplicate key value violates unique constraint "credits_pkey"
DETAIL:  Key (name)=(Rutger Hauer) already exists.

[SQL: INSERT INTO ise_ex4.credits
    (name, birthdate) VALUES
    ('Rutger Hauer', '1961-02-02');]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

- Create the ***stars_in*** table with the following constraints:  
  - None of the attributes may be NULL
  - **`movie_title`** and **`movie_year`** are used as a foreign key from the ***movies*** table
  - **`stars_name`** is used as a foreign key from the ***credits*** table  
  
|movie_title|movie_year|star_name|
|:--------:|:-------:|:--------|
|string    |integer  |string   |

In [23]:
%%sql
CREATE TABLE ise_ex4.stars_in(
    movie_title varchar(40),
    movie_year int,
    star_name varchar(40),
    FOREIGN KEY(movie_title, movie_year) REFERENCES ise_ex4.movies(title, year),
    FOREIGN KEY (star_name) REFERENCES ise_ex4.credits(name)
);

 * postgresql://postgres:***@db
Done.

[]

- Populate the ***stars_in*** table:

|movie_title|movie_year|star_name|
|---------:|:-------:|:-------|
|Arrival|2016|Amy Adams|
|La La Land|2016|Ryan Gosling|
|La La Land|2016|Emma Stone|
|Bladerunner|1982|Rutger Hauer|
|Bladerunner|1982|Harrison Ford|
|Bladerunner|1982|Sean Young|
|Bladerunner 2049|2017|Ryan Gosling|
|Bladerunner 2049|2017|Harrison Ford|

In [24]:
%%sql
INSERT INTO ise_ex4.stars_in
    (movie_title, movie_year, star_name) VALUES 
    ('Arrival', 2016, 'Amy Adams'), 
    ('La La Land', 2016, 'Ryan Gosling'), 
    ('La La Land', 2016, 'Emma Stone'), 
    ('Bladerunner', 1982, 'Rutger Hauer'), 
    ('Bladerunner', 1982, 'Harrison Ford'), 
    ('Bladerunner', 1982, 'Sean Young'), 
    ('Bladerunner 2049', 2017, 'Ryan Gosling'), 
    ('Bladerunner 2049', 2017, 'Harrison Ford');

 * postgresql://postgres:***@db
8 rows affected.

[]

In [25]:
%sql SELECT * FROM ise_ex4.stars_in;

 * postgresql://postgres:***@db
8 rows affected.

[('Arrival', 2016, 'Amy Adams'),
 ('La La Land', 2016, 'Ryan Gosling'),
 ('La La Land', 2016, 'Emma Stone'),
 ('Bladerunner', 1982, 'Rutger Hauer'),
 ('Bladerunner', 1982, 'Harrison Ford'),
 ('Bladerunner', 1982, 'Sean Young'),
 ('Bladerunner 2049', 2017, 'Ryan Gosling'),
 ('Bladerunner 2049', 2017, 'Harrison Ford')]

- Try to insert into the ***stars_in*** table the following tuple:  
  (`movie_title` ↦ Alien, `movie_year` ↦ 1979, `star_name` ↦ Sigourney Weaver)

In [26]:
%%sql
INSERT INTO ise_ex4.stars_in
    (movie_title, movie_year, star_name) VALUES 
    ('Alien', 1979, 'Sigourney Weaver');

 * postgresql://postgres:***@db
(psycopg2.errors.ForeignKeyViolation) insert or update on table "stars_in" violates foreign key constraint "stars_in_movie_title_movie_year_fkey"
DETAIL:  Key (movie_title, movie_year)=(Alien, 1979) is not present in table "movies".

[SQL: INSERT INTO ise_ex4.stars_in
    (movie_title, movie_year, star_name) VALUES
    ('Alien', 1979, 'Sigourney Weaver');]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

- Why did this fail? The error you should have gotten is 'IntegrityError: (psycopg2.errors.UniqueViolation) duplicate key value violates unique constraint "credits_pkey"'

  Write all the **INSERT INTO** SQL queries needed so that you can finally add the tuple above to the ***stars_in*** table.

In [27]:
%%sql
INSERT INTO ise_ex4.movies
    (title, year, length, genre) VALUES 
    ('Alien', 1979, 122, 'Thriller');

 * postgresql://postgres:***@db
1 rows affected.

[]

In [28]:
%%sql
INSERT INTO ise_ex4.credits (name) VALUES ('Sigourney Weaver');

 * postgresql://postgres:***@db
1 rows affected.

[]

- Let's try again. Insert into the ***stars_in*** table the following tuple:  
  (`movie_title` ↦ Alien, `movie_year` ↦ 1979, `star_name` ↦ Sigourney Weaver)

In [29]:
%%sql
INSERT INTO ise_ex4.stars_in
    (movie_title, movie_year, star_name) VALUES 
    ('Alien', 1979, 'Sigourney Weaver');

 * postgresql://postgres:***@db
1 rows affected.

[]

In [30]:
%sql SELECT * FROM ise_ex4.stars_in;

 * postgresql://postgres:***@db
9 rows affected.

[('Arrival', 2016, 'Amy Adams'),
 ('La La Land', 2016, 'Ryan Gosling'),
 ('La La Land', 2016, 'Emma Stone'),
 ('Bladerunner', 1982, 'Rutger Hauer'),
 ('Bladerunner', 1982, 'Harrison Ford'),
 ('Bladerunner', 1982, 'Sean Young'),
 ('Bladerunner 2049', 2017, 'Ryan Gosling'),
 ('Bladerunner 2049', 2017, 'Harrison Ford'),
 ('Alien', 1979, 'Sigourney Weaver')]

- Create the ***directed_by*** table:  
  - **`director_name`** has default value 'random_director'

|movie_title|movie_year|director_name|
|:--------:|:-------:|:----------:|
|string    |integer  |string      |

In [31]:
%%sql
CREATE TABLE ise_ex4.directed_by (
    movie_title char(40),
    movie_year int,
    director_name char(40) DEFAULT 'random_director'
);

 * postgresql://postgres:***@db
Done.

[]

- Alter the ***directed_by*** table, so that the following constraints are satisfied:  
  - **`movie_title`** and **`movie_year`** are used as a foreign key from the ***movies*** table
  - **`director_name`** is used as a foreign key from the ***credits*** table

|movie_title|movie_year|director_name|
|:--------:|:-------:|:----------:|
|string    |integer  |string      |

In [32]:
%%sql
ALTER TABLE ise_ex4.directed_by ADD FOREIGN KEY (movie_title, movie_year) REFERENCES ise_ex4.movies(title, year);
ALTER TABLE ise_ex4.directed_by ADD FOREIGN KEY (director_name) REFERENCES ise_ex4.credits(name);

 * postgresql://postgres:***@db
Done.
Done.

[]

- Populate the ***directed_by*** table:  

|movie_title|movie_year|director_name|
|---------:|:-------:|:-------|
|Arrival|2016|Denis Villeneuve|
|Bladerunner|1982|Ridley Scott|
|Bladerunner 2049|2017|Denis Villeneuve|
|Alien|1979|Ridley Scott|

In [33]:
%%sql
INSERT INTO ise_ex4.directed_by
    (movie_title, movie_year, director_name) VALUES
    ('Arrival', 2016, 'Denis Villeneuve'), 
    ('Bladerunner', 1982, 'Ridley Scott'), 
    ('Bladerunner 2049', 2017, 'Denis Villeneuve'),
    ('Alien', 1979, 'Ridley Scott');

 * postgresql://postgres:***@db
4 rows affected.

[]

In [34]:
%sql SELECT * FROM ise_ex4.directed_by;

 * postgresql://postgres:***@db
4 rows affected.

[('Arrival                                 ', 2016, 'Denis Villeneuve                        '),
 ('Bladerunner                             ', 1982, 'Ridley Scott                            '),
 ('Bladerunner 2049                        ', 2017, 'Denis Villeneuve                        '),
 ('Alien                                   ', 1979, 'Ridley Scott                            ')]

- Create the ***produced_by*** table with the following constraints:  
  - **`movie_title` and **`movie_year`** are used as a foreign key from the ***movies*** table
  - **`producer_name`** has default value 'random_producer' and is used as a foreign key from the ***credits*** table

|movie_title|movie_year|producer_name|
|:--------:|:-------:|:----------:|
|string    |integer  |string      |

In [35]:
%%sql
CREATE TABLE ise_ex4.produced_by(
    movie_title VARCHAR(30),
    movie_year SMALLINT,
    producer_name VARCHAR(30) DEFAULT 'random_producer',
    FOREIGN KEY(movie_title, movie_year) REFERENCES ise_ex4.movies(title, year),
    FOREIGN KEY(producer_name) REFERENCES ise_ex4.credits(name));

 * postgresql://postgres:***@db
Done.

[]

- Populate the ***produced_by*** table:  

|movie_title|movie_year|producer_name|
|---------:|:-------:|:-------|
|Bladerunner 2049|2017|Ridley Scott|

In [36]:
%%sql
INSERT INTO ise_ex4.produced_by VALUES ('Bladerunner 2049', 2017, 'Ridley Scott');

 * postgresql://postgres:***@db
1 rows affected.

[]

In [37]:
%sql SELECT * FROM ise_ex4.produced_by;

 * postgresql://postgres:***@db
1 rows affected.

[('Bladerunner 2049', 2017, 'Ridley Scott')]

- [Delete](https://www.postgresql.org/docs/current/static/sql-delete.html) Ridley Scott from the ***credits*** table (or try at least).

In [39]:
%%sql
DELETE from ise_ex4.credits WHERE name = 'Ridley Scott';

 * postgresql://postgres:***@db
(psycopg2.errors.ForeignKeyViolation) update or delete on table "credits" violates foreign key constraint "directed_by_director_name_fkey" on table "directed_by"
DETAIL:  Key (name)=(Ridley Scott) is still referenced from table "directed_by".

[SQL: DELETE from ise_ex4.credits WHERE name = 'Ridley Scott';]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

* Why did this fail? You should have gotten the error 'ForeignKeyViolation: update or delete on table "credits" violates foreign key constraint "directed_by_director_name_fkey" on table "directed_by"'

- There are a number of ways that behavior of **DELETE** can be altered, namely:  
  - NO ACTION
  - RESTRICT
  - SET DEFAULT
  - SET NULL
  - CASCADE

* You can experiment with the tables we've created so far. We're about to reset the `ise_ex4` schema anyway, so don't worry about breaking things. Try to insert and remove tuples in ways that violate the constraints.

In [ ]:
%%sql

- Let's investigate what happens when we use **CASCADE**.

  This next cell will reset the schema `ise_ex4` to a known state for the following exercises.
  Note the `ON DELETE CASCADE` on the foreign key constraints.

In [40]:
%%sql
DROP SCHEMA IF EXISTS ise_ex4 CASCADE;
CREATE SCHEMA ise_ex4;


CREATE TABLE ise_ex4.movies(
    title VARCHAR(255),
    year SMALLINT CHECK(year >= 1900 AND year <=2100),
    length SMALLINT DEFAULT 120, 
    genre VARCHAR(20) DEFAULT 'Drama',
    PRIMARY KEY(title, year));

INSERT INTO ise_ex4.movies
    (title, year, length, genre) VALUES 
    ('Bladerunner', 1982, 117, 'Thriller'),
    ('Arrival', 2016, 116, 'Sci-Fi'),
    ('La La Land', 2016, 128, 'Drama'),
    ('Bladerunner 2049', 2017, 163, 'Thriller'),
    ('Alien', 1979, 117, 'Horror');
    
    
CREATE TABLE ise_ex4.credits(
    name VARCHAR(30) NULL PRIMARY KEY,
    birthdate DATE DEFAULT '1970-01-01');

INSERT INTO ise_ex4.credits
    (name, birthdate) VALUES 
    ('Denis Villeneuve', '1967-10-03'), 
    ('Amy Adams', '1974-08-20'), 
    ('Ryan Gosling', '1980-11-12'), 
    ('Harrison Ford', '1942-07-12'), 
    ('Ridley Scott', '1937-11-30'), 
    ('Emma Stone', '1988-11-06'), 
    ('Rutger Hauer', '1944-01-23'), 
    ('Sean Young', '1959-11-20'),
    ('Sigourney Weaver', '1949-10-08');

    
CREATE TABLE ise_ex4.stars_in(
    movie_title VARCHAR(255) NOT NULL,
    movie_year SMALLINT NOT NULL,
    star_name VARCHAR(30) NOT NULL REFERENCES ise_ex4.credits(name) ON DELETE CASCADE,
    FOREIGN KEY(movie_title, movie_year) REFERENCES ise_ex4.movies(title, year));

INSERT INTO ise_ex4.stars_in
    (movie_title, movie_year, star_name) VALUES 
    ('Arrival', 2016, 'Amy Adams'), 
    ('La La Land', 2016, 'Ryan Gosling'), 
    ('La La Land', 2016, 'Emma Stone'), 
    ('Bladerunner', 1982, 'Rutger Hauer'), 
    ('Bladerunner', 1982, 'Harrison Ford'), 
    ('Bladerunner', 1982, 'Sean Young'), 
    ('Bladerunner 2049', 2017, 'Ryan Gosling'), 
    ('Bladerunner 2049', 2017, 'Harrison Ford'),
    ('Alien', 1979, 'Sigourney Weaver');


CREATE TABLE ise_ex4.directed_by(
    movie_title VARCHAR(30),
    movie_year SMALLINT,
    director_name VARCHAR(30) DEFAULT 'random_director' REFERENCES ise_ex4.credits(name) ON DELETE CASCADE,
    FOREIGN KEY(movie_title, movie_year) REFERENCES ise_ex4.movies(title, year));

INSERT INTO ise_ex4.directed_by
    (movie_title, movie_year, director_name) VALUES
    ('Arrival', 2016, 'Denis Villeneuve'), 
    ('Bladerunner', 1982, 'Ridley Scott'), 
    ('Bladerunner 2049', 2017, 'Denis Villeneuve'),
    ('Alien', 1979, 'Ridley Scott');

CREATE TABLE ise_ex4.produced_by(
    movie_title VARCHAR(30),
    movie_year SMALLINT,
    producer_name VARCHAR(30) DEFAULT 'random_producer',
    FOREIGN KEY(movie_title, movie_year) REFERENCES ise_ex4.movies(title, year),
    FOREIGN KEY(producer_name) REFERENCES ise_ex4.credits(name) ON DELETE CASCADE);

INSERT INTO ise_ex4.produced_by
    (movie_title, movie_year, producer_name) VALUES
    ('Bladerunner 2049', 2017, 'Ridley Scott');

 * postgresql://postgres:***@db
Done.
Done.
Done.
5 rows affected.
Done.
9 rows affected.
Done.
9 rows affected.
Done.
4 rows affected.
Done.
1 rows affected.

[]

- Delete Ridley Scott from the ***credits*** table.

In [41]:
%%sql
DELETE from ise_ex4.credits WHERE name = 'Ridley Scott';

 * postgresql://postgres:***@db
1 rows affected.

[]

In [42]:
%sql SELECT * FROM ise_ex4.credits;

 * postgresql://postgres:***@db
8 rows affected.

[('Denis Villeneuve', datetime.date(1967, 10, 3)),
 ('Amy Adams', datetime.date(1974, 8, 20)),
 ('Ryan Gosling', datetime.date(1980, 11, 12)),
 ('Harrison Ford', datetime.date(1942, 7, 12)),
 ('Emma Stone', datetime.date(1988, 11, 6)),
 ('Rutger Hauer', datetime.date(1944, 1, 23)),
 ('Sean Young', datetime.date(1959, 11, 20)),
 ('Sigourney Weaver', datetime.date(1949, 10, 8))]

* Rows that reference `Ridley Scott` are now gone from all the tables with integrity constraints with `ise_ex4.credits`.

In [43]:
%sql SELECT * FROM ise_ex4.stars_in;

 * postgresql://postgres:***@db
9 rows affected.

[('Arrival', 2016, 'Amy Adams'),
 ('La La Land', 2016, 'Ryan Gosling'),
 ('La La Land', 2016, 'Emma Stone'),
 ('Bladerunner', 1982, 'Rutger Hauer'),
 ('Bladerunner', 1982, 'Harrison Ford'),
 ('Bladerunner', 1982, 'Sean Young'),
 ('Bladerunner 2049', 2017, 'Ryan Gosling'),
 ('Bladerunner 2049', 2017, 'Harrison Ford'),
 ('Alien', 1979, 'Sigourney Weaver')]

In [44]:
%sql SELECT * FROM ise_ex4.directed_by;

 * postgresql://postgres:***@db
2 rows affected.

[('Arrival', 2016, 'Denis Villeneuve'),
 ('Bladerunner 2049', 2017, 'Denis Villeneuve')]

In [45]:
%sql SELECT * FROM ise_ex4.produced_by;

 * postgresql://postgres:***@db
0 rows affected.

[]

* We are about to reset the schema again, so feel free to experiment here too.

In [ ]:
%%sql

- Let's try this time with **SET DEFAULT**:

  Again, this next cell will reset the schema.

In [57]:
%%sql
DROP SCHEMA IF EXISTS ise_ex4 CASCADE;
CREATE SCHEMA ise_ex4;


CREATE TABLE ise_ex4.movies(
    title VARCHAR(255),
    year SMALLINT CHECK(year >= 1900 AND year <=2100),
    length SMALLINT DEFAULT 120, 
    genre VARCHAR(20) DEFAULT 'Drama',
    PRIMARY KEY(title, year));

INSERT INTO ise_ex4.movies
    (title, year, length, genre) VALUES 
    ('Bladerunner', 1982, 117, 'Thriller'),
    ('Arrival', 2016, 116, 'Sci-Fi'),
    ('La La Land', 2016, 128, 'Drama'),
    ('Bladerunner 2049', 2017, 163, 'Thriller'),
    ('Alien', 1979, 117, 'Horror');
    
    
CREATE TABLE ise_ex4.credits(
    name VARCHAR(30) NULL PRIMARY KEY,
    birthdate DATE DEFAULT '1970-01-01');

INSERT INTO ise_ex4.credits
    (name, birthdate) VALUES 
    ('Denis Villeneuve', '1967-10-03'), 
    ('Amy Adams', '1974-08-20'), 
    ('Ryan Gosling', '1980-11-12'), 
    ('Harrison Ford', '1942-07-12'), 
    ('Ridley Scott', '1937-11-30'), 
    ('Emma Stone', '1988-11-06'), 
    ('Rutger Hauer', '1944-01-23'), 
    ('Sean Young', '1959-11-20'),
    ('Sigourney Weaver', '1949-10-08');

    
CREATE TABLE ise_ex4.stars_in(
    movie_title VARCHAR(255) NOT NULL,
    movie_year SMALLINT NOT NULL,
    star_name VARCHAR(30) NOT NULL REFERENCES ise_ex4.credits(name) ON DELETE SET DEFAULT,
    FOREIGN KEY(movie_title, movie_year) REFERENCES ise_ex4.movies(title, year));

INSERT INTO ise_ex4.stars_in
    (movie_title, movie_year, star_name) VALUES 
    ('Arrival', 2016, 'Amy Adams'), 
    ('La La Land', 2016, 'Ryan Gosling'), 
    ('La La Land', 2016, 'Emma Stone'), 
    ('Bladerunner', 1982, 'Rutger Hauer'), 
    ('Bladerunner', 1982, 'Harrison Ford'), 
    ('Bladerunner', 1982, 'Sean Young'), 
    ('Bladerunner 2049', 2017, 'Ryan Gosling'), 
    ('Bladerunner 2049', 2017, 'Harrison Ford'),
    ('Alien', 1979, 'Sigourney Weaver');


CREATE TABLE ise_ex4.directed_by(
    movie_title VARCHAR(30),
    movie_year SMALLINT,
    director_name VARCHAR(30) DEFAULT 'random_director' REFERENCES ise_ex4.credits(name) ON DELETE SET DEFAULT,
    FOREIGN KEY(movie_title, movie_year) REFERENCES ise_ex4.movies(title, year));

INSERT INTO ise_ex4.directed_by
    (movie_title, movie_year, director_name) VALUES
    ('Arrival', 2016, 'Denis Villeneuve'), 
    ('Bladerunner', 1982, 'Ridley Scott'), 
    ('Bladerunner 2049', 2017, 'Denis Villeneuve'),
    ('Alien', 1979, 'Ridley Scott');

CREATE TABLE ise_ex4.produced_by(
    movie_title VARCHAR(30),
    movie_year SMALLINT,
    producer_name VARCHAR(30) DEFAULT 'random_producer',
    FOREIGN KEY(movie_title, movie_year) REFERENCES ise_ex4.movies(title, year),
    FOREIGN KEY(producer_name) REFERENCES ise_ex4.credits(name) ON DELETE SET DEFAULT);

INSERT INTO ise_ex4.produced_by
    (movie_title, movie_year, producer_name) VALUES
    ('Bladerunner 2049', 2017, 'Ridley Scott');

 * postgresql://postgres:***@db
Done.
Done.
Done.
5 rows affected.
Done.
9 rows affected.
Done.
9 rows affected.
Done.
4 rows affected.
Done.
1 rows affected.

[]

- Delete Ridley Scott from the ***credits*** table.

In [58]:
%%sql
DELETE from ise_ex4.credits WHERE name = 'Ridley Scott';

 * postgresql://postgres:***@db
(psycopg2.errors.ForeignKeyViolation) insert or update on table "directed_by" violates foreign key constraint "directed_by_director_name_fkey"
DETAIL:  Key (director_name)=(random_director) is not present in table "credits".

[SQL: DELETE from ise_ex4.credits WHERE name = 'Ridley Scott';]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

- Why did the operation fail? Add the missing tuples (to `ise_ex4.credits`) in order to fix it.

In [59]:
%%sql
INSERT INTO ise_ex4.credits (name) VALUES ('random_director');
INSERT INTO ise_ex4.credits (name) VALUES ('random_producer');

 * postgresql://postgres:***@db
1 rows affected.
1 rows affected.

[]

- Delete Ridley Scott from the ***credits*** table.

In [60]:
%%sql
DELETE FROM ise_ex4.credits WHERE name = 'Ridley Scott';

 * postgresql://postgres:***@db
1 rows affected.

[]

In [61]:
%sql SELECT * FROM ise_ex4.credits;

 * postgresql://postgres:***@db
10 rows affected.

[('Denis Villeneuve', datetime.date(1967, 10, 3)),
 ('Amy Adams', datetime.date(1974, 8, 20)),
 ('Ryan Gosling', datetime.date(1980, 11, 12)),
 ('Harrison Ford', datetime.date(1942, 7, 12)),
 ('Emma Stone', datetime.date(1988, 11, 6)),
 ('Rutger Hauer', datetime.date(1944, 1, 23)),
 ('Sean Young', datetime.date(1959, 11, 20)),
 ('Sigourney Weaver', datetime.date(1949, 10, 8)),
 ('random_director', datetime.date(1970, 1, 1)),
 ('random_producer', datetime.date(1970, 1, 1))]

In [62]:
%sql SELECT * FROM ise_ex4.stars_in;

 * postgresql://postgres:***@db
9 rows affected.

[('Arrival', 2016, 'Amy Adams'),
 ('La La Land', 2016, 'Ryan Gosling'),
 ('La La Land', 2016, 'Emma Stone'),
 ('Bladerunner', 1982, 'Rutger Hauer'),
 ('Bladerunner', 1982, 'Harrison Ford'),
 ('Bladerunner', 1982, 'Sean Young'),
 ('Bladerunner 2049', 2017, 'Ryan Gosling'),
 ('Bladerunner 2049', 2017, 'Harrison Ford'),
 ('Alien', 1979, 'Sigourney Weaver')]

In [63]:
%sql SELECT * FROM ise_ex4.directed_by;

 * postgresql://postgres:***@db
4 rows affected.

[('Arrival', 2016, 'Denis Villeneuve'),
 ('Bladerunner 2049', 2017, 'Denis Villeneuve'),
 ('Bladerunner', 1982, 'random_director'),
 ('Alien', 1979, 'random_director')]

In [64]:
%sql SELECT * FROM ise_ex4.produced_by;

 * postgresql://postgres:***@db
1 rows affected.

[('Bladerunner 2049', 2017, 'random_producer')]

- Finally, let's try this time with **SET NULL**:

In [ ]:
%%sql
DROP SCHEMA IF EXISTS ise_ex4 CASCADE;
CREATE SCHEMA ise_ex4;


CREATE TABLE ise_ex4.movies(
    title VARCHAR(255),
    year SMALLINT CHECK(year >= 1900 AND year <=2100),
    length SMALLINT DEFAULT 120, 
    genre VARCHAR(20) DEFAULT 'Drama',
    PRIMARY KEY(title, year));

INSERT INTO ise_ex4.movies
    (title, year, length, genre) VALUES 
    ('Bladerunner', 1982, 117, 'Thriller'),
    ('Arrival', 2016, 116, 'Sci-Fi'),
    ('La La Land', 2016, 128, 'Drama'),
    ('Bladerunner 2049', 2017, 163, 'Thriller'),
    ('Alien', 1979, 117, 'Horror');
    
    
CREATE TABLE ise_ex4.credits(
    name VARCHAR(30) NULL PRIMARY KEY,
    birthdate DATE DEFAULT '1970-01-01');

INSERT INTO ise_ex4.credits
    (name, birthdate) VALUES 
    ('Denis Villeneuve', '1967-10-03'), 
    ('Amy Adams', '1974-08-20'), 
    ('Ryan Gosling', '1980-11-12'), 
    ('Harrison Ford', '1942-07-12'), 
    ('Ridley Scott', '1937-11-30'), 
    ('Emma Stone', '1988-11-06'), 
    ('Rutger Hauer', '1944-01-23'), 
    ('Sean Young', '1959-11-20'),
    ('Sigourney Weaver', '1949-10-08');

    
CREATE TABLE ise_ex4.stars_in(
    movie_title VARCHAR(255) NOT NULL,
    movie_year SMALLINT NOT NULL,
    star_name VARCHAR(30) NOT NULL REFERENCES ise_ex4.credits(name) ON DELETE SET NULL,
    FOREIGN KEY(movie_title, movie_year) REFERENCES ise_ex4.movies(title, year));

INSERT INTO ise_ex4.stars_in
    (movie_title, movie_year, star_name) VALUES 
    ('Arrival', 2016, 'Amy Adams'), 
    ('La La Land', 2016, 'Ryan Gosling'), 
    ('La La Land', 2016, 'Emma Stone'), 
    ('Bladerunner', 1982, 'Rutger Hauer'), 
    ('Bladerunner', 1982, 'Harrison Ford'), 
    ('Bladerunner', 1982, 'Sean Young'), 
    ('Bladerunner 2049', 2017, 'Ryan Gosling'), 
    ('Bladerunner 2049', 2017, 'Harrison Ford'),
    ('Alien', 1979, 'Sigourney Weaver');


CREATE TABLE ise_ex4.directed_by(
    movie_title VARCHAR(30),
    movie_year SMALLINT,
    director_name VARCHAR(30) DEFAULT 'random_director' REFERENCES ise_ex4.credits(name) ON DELETE SET NULL,
    FOREIGN KEY(movie_title, movie_year) REFERENCES ise_ex4.movies(title, year));

INSERT INTO ise_ex4.directed_by
    (movie_title, movie_year, director_name) VALUES
    ('Arrival', 2016, 'Denis Villeneuve'), 
    ('Bladerunner', 1982, 'Ridley Scott'), 
    ('Bladerunner 2049', 2017, 'Denis Villeneuve'),
    ('Alien', 1979, 'Ridley Scott');

CREATE TABLE ise_ex4.produced_by(
    movie_title VARCHAR(30),
    movie_year SMALLINT,
    producer_name VARCHAR(30) DEFAULT 'random_producer',
    FOREIGN KEY(movie_title, movie_year) REFERENCES ise_ex4.movies(title, year),
    FOREIGN KEY(producer_name) REFERENCES ise_ex4.credits(name) ON DELETE SET NULL);

INSERT INTO ise_ex4.produced_by
    (movie_title, movie_year, producer_name) VALUES
    ('Bladerunner 2049', 2017, 'Ridley Scott');

- Delete Ridley Scott from the ***credits*** table.

In [65]:
%%sql
DELETE FROM ise_ex4.credits WHERE name = 'Ridley Scott';

 * postgresql://postgres:***@db
0 rows affected.

[]

In [66]:
%sql SELECT * FROM ise_ex4.credits;

 * postgresql://postgres:***@db
10 rows affected.

[('Denis Villeneuve', datetime.date(1967, 10, 3)),
 ('Amy Adams', datetime.date(1974, 8, 20)),
 ('Ryan Gosling', datetime.date(1980, 11, 12)),
 ('Harrison Ford', datetime.date(1942, 7, 12)),
 ('Emma Stone', datetime.date(1988, 11, 6)),
 ('Rutger Hauer', datetime.date(1944, 1, 23)),
 ('Sean Young', datetime.date(1959, 11, 20)),
 ('Sigourney Weaver', datetime.date(1949, 10, 8)),
 ('random_director', datetime.date(1970, 1, 1)),
 ('random_producer', datetime.date(1970, 1, 1))]

In [67]:
%sql SELECT * FROM ise_ex4.stars_in;

 * postgresql://postgres:***@db
9 rows affected.

[('Arrival', 2016, 'Amy Adams'),
 ('La La Land', 2016, 'Ryan Gosling'),
 ('La La Land', 2016, 'Emma Stone'),
 ('Bladerunner', 1982, 'Rutger Hauer'),
 ('Bladerunner', 1982, 'Harrison Ford'),
 ('Bladerunner', 1982, 'Sean Young'),
 ('Bladerunner 2049', 2017, 'Ryan Gosling'),
 ('Bladerunner 2049', 2017, 'Harrison Ford'),
 ('Alien', 1979, 'Sigourney Weaver')]

In [68]:
%sql SELECT * FROM ise_ex4.directed_by;

 * postgresql://postgres:***@db
4 rows affected.

[('Arrival', 2016, 'Denis Villeneuve'),
 ('Bladerunner 2049', 2017, 'Denis Villeneuve'),
 ('Bladerunner', 1982, 'random_director'),
 ('Alien', 1979, 'random_director')]

In [69]:
%sql SELECT * FROM ise_ex4.produced_by;

 * postgresql://postgres:***@db
1 rows affected.

[('Bladerunner 2049', 2017, 'random_producer')]

* In the following, we'll provide much less guidance so you can see how familiar you are with the concepts explained so far.

- Copy/paste and modify the script below so that the following constraints are satisfied:  
  
  - ***cards*** table:
    - Attribute `id` is primary key
    - Attribute `name` is unique
  - ***classes*** table:
    - Attribute `name` is primary key
  - ***sets*** table:
    - Attribute `name` is primary key
  - ***races*** table:
    - Attribute `name` is primary key
  - ***minions*** table:
    - Attribute `name` is foreign key, referencing attribute `name` of the ***cards*** table
    - Attributes `mana`, `attack` and `health` cannot be negative
    - Attribute `race` is foreign key, referencing attribute `name` of the ***races*** table
    - Attribute `class` is foreign key, referencing attribute `name` of the ***classes*** table
    - Attribute `set` is foreign key, referencing attribute `name` of the ***sets*** table
  - ***abilities*** table:
    - Attribute `name` is foreign key, referencing attribute `name` of the ***cards*** table
    - Attribute `mana` cannot be negative
    - Attribute `class` is foreign key, referencing attribute `name` of the ***classes*** table
    - Attribute `set` is foreign key, referencing attribute `name` of the ***sets*** table
  - ***weapons*** table:
    - Attribute `name` is foreign key, referencing attribute `name` of the ***cards*** table
    - Attributes `mana`, `attack` and `durability` cannot be negative
    - Attribute `class` is foreign key, referencing attribute `name` of the ***classes*** table
    - Attribute `set` is foreign key, referencing attribute `name` of the ***sets*** table
  - ***playable_heroes*** table:
    - Attribute `name` is foreign key, referencing attribute `name` of the ***cards*** table
    - Attribute `mana` cannot be negative
    - Attribute `class` is foreign key, referencing attribute `name` of the ***classes*** table
    - Attribute `set` is foreign key, referencing attribute `name` of the ***sets*** table

```SQL
DROP SCHEMA IF EXISTS ise_ex4_hs CASCADE;
CREATE SCHEMA ise_ex4_hs;


CREATE TABLE ise_ex4_hs.cards(
    id INT NOT NULL,
    name VARCHAR(30) NOT NULL);

INSERT INTO ise_ex4_hs.cards
    (id, name) VALUES
    (1, 'Explosive Trap'),
    (2, 'Crackle'),
    (3, 'Ysera'),
    (4, 'Mechanical Yeti'),
    (5, 'Frost Lich Jaina'),
    (6, 'Lord Jaraxxus'),
    (7, 'Gorehowl'),
    (8, 'Drakonid Operator'),
    (9, 'Kvaldir Raider'),
    (10, 'Zombie Chow'),
    (11, 'Murloc Tinyfin'),
    (12, 'Grim Patron'),
    (13, 'Mind Control');
    
    
CREATE TABLE ise_ex4_hs.classes(
    name VARCHAR(20) NOT NULL);

INSERT INTO ise_ex4_hs.classes VALUES
    ('Neutral'), ('Druid'), ('Hunter'),
    ('Mage'), ('Paladin'), ('Priest'),
    ('Rogue'), ('Shaman'), ('Warlock'), ('Warrior');
    

CREATE TABLE ise_ex4_hs.sets(
    name VARCHAR(255) NOT NULL);

INSERT INTO ise_ex4_hs.sets VALUES
    ('Basic'), ('Expert'), ('Curse of Naxxramas'),
    ('Goblins vs Gnomes'), ('Blackrock Mountain'), ('The Grand Tournament'),
    ('League of Explorers'), ('Whispers of the Old Gods'), ('Mean Streets of Gadgetzan'),
    ('One Night in Karazhan'), ('Journey to Un''Goro'), ('Knights of the Frozen Throne');
    
    
CREATE TABLE ise_ex4_hs.races(
    name VARCHAR(20) NOT NULL);

INSERT INTO ise_ex4_hs.races VALUES
    ('Beast'), ('Elemental'), ('Demon'), ('Dragon'),
    ('Mech'), ('Murloc'), ('Pirate'), ('Totem');
    
    
CREATE TABLE ise_ex4_hs.minions(
    name VARCHAR(30) NOT NULL,
    mana INT NOT NULL,
    attack INT NOT NULL,
    health INT NOT NULL,
    race VARCHAR(20) NULL,
    class VARCHAR(20) NOT NULL,
    set VARCHAR(255) NOT NULL);

INSERT INTO ise_ex4_hs.minions
    (name, mana, attack, health, race, class, set) VALUES
    ('Ysera', 9, 4, 12, 'Dragon', 'Neutral', 'Expert'),
    ('Mechanical Yeti', 4, 4, 5, 'Mech', 'Neutral', 'Goblins vs Gnomes'),
    ('Lord Jaraxxus', 9, 3, 15, 'Demon', 'Warlock', 'Expert'), 
    ('Drakonid Operator', 5, 5, 6, 'Dragon', 'Priest', 'Mean Streets of Gadgetzan'), 
    ('Kvaldir Raider', 5, 4, 4, DEFAULT, 'Neutral', 'The Grand Tournament'), 
    ('Zombie Chow', 1, 2, 3, DEFAULT, 'Neutral', 'Curse of Naxxramas'),
    ('Murloc Tinyfin', 0, 1, 1, 'Murloc', 'Neutral', 'League of Explorers'),
    ('Grim Patron', 5, 3, 3, DEFAULT, 'Neutral', 'Blackrock Mountain');
    
    
CREATE TABLE ise_ex4_hs.abilities(
    name VARCHAR(30) NOT NULL,
    mana INT NOT NULL,
    class VARCHAR(20) NOT NULL,
    set VARCHAR(255) NOT NULL);

INSERT INTO ise_ex4_hs.abilities
    (name, mana, class, set) VALUES
    ('Explosive Trap', 2, 'Hunter', 'Expert'),
    ('Crackle', 2, 'Shaman', 'Goblins vs Gnomes'),
    ('Mind Control', 10, 'Priest', 'Basic');
    
    
CREATE TABLE ise_ex4_hs.weapons(
    name VARCHAR(30) NOT NULL,
    mana INT NOT NULL,
    attack INT NOT NULL,
    durability INT NOT NULL,
    class VARCHAR(20) not NULL,
    set VARCHAR(255) NOT NULL);

INSERT INTO ise_ex4_hs.weapons
    (name, mana, attack, durability, class, set) VALUES
    ('Gorehowl', 7, 7, 1, 'Warrior', 'Expert');
    

CREATE TABLE ise_ex4_hs.playable_heroes(
    name VARCHAR(30) NOT NULL,
    mana INT NOT NULL,
    class VARCHAR(20) NOT NULL,
    set VARCHAR(255) NOT NULL);

INSERT INTO ise_ex4_hs.playable_heroes
    (name, mana, class, set) VALUES
    ('Frost Lich Jaina', 9, 'Mage', 'Knights of the Frozen Throne');
```

In [ ]:
%%sql

In [ ]:
%sql SELECT * FROM ise_ex4_hs.cards;

In [ ]:
%sql SELECT * FROM ise_ex4_hs.races;

In [ ]:
%sql SELECT * FROM ise_ex4_hs.classes;

In [ ]:
%sql SELECT * FROM ise_ex4_hs.sets;

In [ ]:
%sql SELECT * FROM ise_ex4_hs.minions;

In [ ]:
%sql SELECT * FROM ise_ex4_hs.abilities;

In [ ]:
%sql SELECT * FROM ise_ex4_hs.playable_heroes;

- Copy/paste and modify your script (the one with the primary/foreign keys), so that the following will occur:  
  - When deleting Frost Lich Jaina from ***cards***, she also gets deleted from ***playable_heroes***
  - When deleting Gorehowl from ***cards***, in ***weapons*** its name changes to 'placeholder'
  - When deleting Crackle from ***cards***, in ***abilities*** its name becomes NULL/None

In [ ]:
%%sql

In [ ]:
%%sql
DELETE FROM ise_ex4_hs.cards WHERE name = 'Frost Lich Jaina';
DELETE FROM ise_ex4_hs.cards WHERE name = 'Gorehowl';
DELETE FROM ise_ex4_hs.cards WHERE name = 'Crackle';

In [ ]:
%sql SELECT * FROM ise_ex4_hs.cards;

In [ ]:
%sql SELECT * FROM ise_ex4_hs.races;

In [ ]:
%sql SELECT * FROM ise_ex4_hs.classes;

In [ ]:
%sql SELECT * FROM ise_ex4_hs.sets;

In [ ]:
%sql SELECT * FROM ise_ex4_hs.minions;

In [ ]:
%sql SELECT * FROM ise_ex4_hs.weapons;

In [ ]:
%sql SELECT * FROM ise_ex4_hs.abilities;

In [ ]:
%sql SELECT * FROM ise_ex4_hs.playable_heroes;

- Think about deleting Mind Control from the ***cards*** table. As already seen, depending on the **ON DELETE** option selected, there will be different effects on the table ***abilities***, specifically in the ***name*** entry for Mind Control. Now consider the scenario where by deleting, among others, Mind Control from the ***cards*** table, the Mind Control tuple in the ***abilities*** table becomes:
```
  (placeholder, 0, Neutral, Expert)  
```
  Modify your last script so that you can reproduce this effect. You will have to delete tuples in more than one tables (and of course set the necessary **ON DELETE** options). 
  (hint: you may have to create another table as well ...)

In [ ]:
%%sql

- Delete the necessary tuples in order to get the desired result in ***abilities***

In [ ]:
%%sql
DELETE FROM ise_ex4_hs.cards WHERE name = 'Mind Control';
DELETE FROM ise_ex4_hs.mana_values WHERE mana = 10;
DELETE FROM ise_ex4_hs.classes WHERE name = 'Priest';
DELETE FROM ise_ex4_hs.sets WHERE name = 'Basic';

In [ ]:
%sql SELECT * FROM ise_ex4_hs.cards;

In [ ]:
%sql SELECT * FROM ise_ex4_hs.races;

In [ ]:
%sql SELECT * FROM ise_ex4_hs.classes;

In [ ]:
%sql SELECT * FROM ise_ex4_hs.sets;

In [ ]:
%sql SELECT * FROM ise_ex4_hs.minions;

In [ ]:
%sql SELECT * FROM ise_ex4_hs.weapons;

In [ ]:
%sql SELECT * FROM ise_ex4_hs.abilities;

In [ ]:
%sql SELECT * FROM ise_ex4_hs.playable_heroes;

- This next exercise is optional. It presents the issue of potential circular dependencies with foreign keys.
  Run the following script.

In [ ]:
%%sql
DROP SCHEMA IF EXISTS ise_ex4_hs CASCADE;
CREATE SCHEMA ise_ex4_hs;


CREATE TABLE ise_ex4_hs.cards(
    id INT PRIMARY KEY,
    name VARCHAR(30) UNIQUE NOT NULL);

INSERT INTO ise_ex4_hs.cards
    (id, name) VALUES
    (3, 'Ysera'),
    (4, 'Mechanical Yeti'),
    (6, 'Lord Jaraxxus'),
    (8, 'Drakonid Operator'),
    (9, 'Kvaldir Raider'),
    (10, 'Zombie Chow'),
    (11, 'Murloc Tinyfin'),
    (12, 'Grim Patron'),
    (14, 'Voodoo Doctor'),
    (15, 'C''thun'),
    (16, 'Kazakus'),
    (17, 'Silverware Golem'),
    (18, 'Tyrantus'),
    (19, 'Bonemare');
    
    
CREATE TABLE ise_ex4_hs.classes(
    name VARCHAR(20) PRIMARY KEY);

INSERT INTO ise_ex4_hs.classes VALUES
    ('Neutral'), ('Druid'), ('Hunter'),
    ('Mage'), ('Paladin'), ('Priest'),
    ('Rogue'), ('Shaman'), ('Warlock'), ('Warrior');
    

CREATE TABLE ise_ex4_hs.sets(
    name VARCHAR(255) PRIMARY KEY);

INSERT INTO ise_ex4_hs.sets VALUES
    ('Basic'), ('Expert'), ('Curse of Naxxramas'),
    ('Goblins vs Gnomes'), ('Blackrock Mountain'), ('the cake is a lie'), ('The Grand Tournament'),
    ('League of Explorers'), ('Whispers of the Old Gods'), ('Mean Streets of Gadgetzan'),
    ('One Night in Karazhan'), ('Journey to Un''Goro'), ('Knights of the Frozen Throne');
    
    
CREATE TABLE ise_ex4_hs.races(
    name VARCHAR(20) PRIMARY KEY);

INSERT INTO ise_ex4_hs.races VALUES
    ('Beast'), ('Elemental'), ('Demon'), ('Dragon'),
    ('Mech'), ('Murloc'), ('Pirate'), ('Totem');
    
    
CREATE TABLE ise_ex4_hs.minions(
    name VARCHAR(30) NOT NULL REFERENCES ise_ex4_hs.cards(name),
    mana INT NOT NULL CHECK(mana >= 0),
    attack INT NOT NULL CHECK(attack >= 0),
    health INT NOT NULL CHECK(health >= 0),
    race VARCHAR(20) NULL REFERENCES ise_ex4_hs.races(name),
    class VARCHAR(20) NOT NULL REFERENCES ise_ex4_hs.classes(name),
    set VARCHAR(255) NOT NULL REFERENCES ise_ex4_hs.sets(name));

INSERT INTO ise_ex4_hs.minions
    (name, mana, attack, health, race, class, set) VALUES
    ('Ysera', 9, 4, 12, 'Dragon', 'Neutral', 'Expert'),
    ('Mechanical Yeti', 4, 4, 5, 'Mech', 'Neutral', 'Goblins vs Gnomes'),
    ('Lord Jaraxxus', 9, 3, 15, 'Demon', 'Warlock', 'Expert'), 
    ('Drakonid Operator', 5, 5, 6, 'Dragon', 'Priest', 'Mean Streets of Gadgetzan'), 
    ('Kvaldir Raider', 5, 4, 4, DEFAULT, 'Neutral', 'The Grand Tournament'), 
    ('Zombie Chow', 1, 2, 3, DEFAULT, 'Neutral', 'Curse of Naxxramas'),
    ('Murloc Tinyfin', 0, 1, 1, 'Murloc', 'Neutral', 'League of Explorers'),
    ('Grim Patron', 5, 3, 3, DEFAULT, 'Neutral', 'Blackrock Mountain'),
    ('Voodoo Doctor', 1, 2, 1, DEFAULT, 'Neutral', 'Basic'),
    ('C''thun', 10, 6, 6, DEFAULT, 'Neutral', 'Whispers of the Old Gods'),
    ('Kazakus', 4, 3, 3, DEFAULT, 'Neutral', 'Mean Streets of Gadgetzan'),
    ('Silverware Golem', 3, 3, 3, DEFAULT, 'Warlock', 'One Night in Karazhan'),
    ('Tyrantus', 10, 12, 12, 'Beast', 'Druid', 'Journey to Un''Goro'),
    ('Bonemare', 7, 5, 5, DEFAULT, 'Neutral', 'Knights of the Frozen Throne');

- Add a foreign key constraint to the ***cards*** table: cards.name references minions.name  
  (You may need to add other constraints too)

In [ ]:
%%sql

- Try to insert the following tuple to the ***cards*** table:  
  (20, Coliseum Manager)

In [ ]:
%sql

- Try to insert the following tuple to the ***minions*** table:  
  (Coliseum Manager, 3, 2, 5, -, Neutral, The Grand Tournament)

In [ ]:
%%sql

- Those interested can read [here](https://www.postgresql.org/docs/current/static/sql-set-constraints.html) how the issue may be potentially resolved. Unfortunately though, to apply it in practice you need 'transactions', which are well beyond the concept of this exercise and are not even supported by ipython/jupyter. Still, it is good to have a good grasp of the pitfalls of foreign keys and how to solve them.